import React from "react";const AboutUs = () => {
   return (
      <div id="about-us">
         <div className="container">
            <div className="about-us">
               <p className="left">О нас</p>
               <p className="right">
                  Добро пожаловать в мир ароматов, где каждая нота — это
                  отражение вашей индивидуальности. В нашем парфюмерном магазине
                  мы предлагаем вам не просто ароматы, а истории, которые
                  оживают на вашей коже и заполняют пространство вокруг вас
                  загадочностью и очарованием. Наша коллекция включает в себя
                  шедевры мировых брендов и эксклюзивные находки от талантливых
                  парфюмеров. От классических древесных и цветочных композиций
                  до современных ароматов, вдохновленных природой и искусством,
                  здесь вы обязательно найдете тот, который подчеркнет вашу
                  уникальность.
               </p>
            </div>
         </div>
      </div>
   );
};

export default AboutUs;
